#### Terraform Plan for development
---
#### Terraform Format and Style 🖌`skipped`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
random_id.node_id: Refreshing state... [id=3Rg]
data.aws_ami.server_ami: Reading...
aws_s3_bucket.vpc-fl-bucket: Refreshing state... [id=cashewhands-fl-s3-bucket]
aws_vpc.vpc: Refreshing state... [id=vpc-07193208af8312cf9]
data.aws_ami.server_ami: Read complete after 0s [id=ami-01d08089481510ba2]
aws_security_group.webserver_sg: Refreshing state... [id=sg-05f49d53b4daf680a]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # aws_s3_bucket.vpc-fl-bucket has changed
  ~ resource "aws_s3_bucket" "vpc-fl-bucket" {
      + arn           = "arn:aws:s3:::cashewhands-fl-s3-bucket"
        id            = "cashewhands-fl-s3-bucket"
        # (3 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_flow_log.vpc-fl will be created
  + resource "aws_flow_log" "vpc-fl" {
      + arn                      = (known after apply)
      + iam_role_arn             = (known after apply)
      + id                       = (known after apply)
      + log_destination          = (known after apply)
      + log_destination_type     = "s3"
      + log_format               = (known after apply)
      + log_group_name           = (known after apply)
      + max_aggregation_interval = 600
      + tags_all                 = {
          + "Backup"        = "false"
          + "Environment"   = "development"
          + "Product-Owner" = "cashewhands"
          + "Project"       = "terraform-masterclass"
          + "Purpose"       = "CICD Pipeline involving Terraform and Github Actions"
          + "Repo"          = "https://github.com/cashewhands/terraform-masterclass"
          + "Team"          = "cashewhands"
          + "Terraform"     = "true"
        }
      + traffic_type             = "ALL"
      + vpc_id                   = "vpc-07193208af8312cf9"
    }

  # aws_iam_role.vpc-fl will be created
  + resource "aws_iam_role" "vpc-fl" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "vpc-flow-logs.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "cashewhands-vpc-fl"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "Backup"        = "false"
          + "Environment"   = "development"
          + "Product-Owner" = "cashewhands"
          + "Project"       = "terraform-masterclass"
          + "Purpose"       = "CICD Pipeline involving Terraform and Github Actions"
          + "Repo"          = "https://github.com/cashewhands/terraform-masterclass"
          + "Team"          = "cashewhands"
          + "Terraform"     = "true"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role_policy.vpc-fl will be created
  + resource "aws_iam_role_policy" "vpc-fl" {
      + id     = (known after apply)
      + name   = "flow-log-policy"
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:CreateLogGroup",
                          + "logs:CreateLogStream",
                          + "logs:PutLogEvents",
                          + "logs:DescribeLogGroups",
                          + "logs:DescribeLogStreams",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role   = (known after apply)
    }

  # aws_instance.webserver will be created
  + resource "aws_instance" "webserver" {
      + ami                                  = "ami-01d08089481510ba2"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = (known after apply)
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + subnet_id                            = (known after apply)
      + tags_all                             = {
          + "Backup"        = "false"
          + "Environment"   = "development"
          + "Product-Owner" = "cashewhands"
          + "Project"       = "terraform-masterclass"
          + "Purpose"       = "CICD Pipeline involving Terraform and Github Actions"
          + "Repo"          = "https://github.com/cashewhands/terraform-masterclass"
          + "Team"          = "cashewhands"
          + "Terraform"     = "true"
        }
      + tenancy                              = (known after apply)
      + user_data                            = "fbe390da02fdac1cf5789e87d11ba65b18001111"
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = [
          + "sg-05f49d53b4daf680a",
        ]

      + capacity_reservation_specification {
          + capacity_reservation_preference = (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id                 = (known after apply)
              + capacity_reservation_resource_group_arn = (known after apply)
            }
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + enclave_options {
          + enabled = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + maintenance_options {
          + auto_recovery = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
          + instance_metadata_tags      = (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_card_index    = (known after apply)
          + network_interface_id  = (known after apply)
        }

      + private_dns_name_options {
          + enable_resource_name_dns_a_record    = (known after apply)
          + enable_resource_name_dns_aaaa_record = (known after apply)
          + hostname_type                        = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
    }

  # aws_s3_bucket.vpc-fl-bucket is tainted, so must be replaced
-/+ resource "aws_s3_bucket" "vpc-fl-bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      ~ arn                         = "arn:aws:s3:::cashewhands-fl-s3-bucket" -> (known after apply)
      ~ bucket                      = "cashewhands-fl-s3-bucket" -> "cashewhands-flogs-s3-bucket"
      ~ bucket_domain_name          = "cashewhands-fl-s3-bucket.s3.amazonaws.com" -> (known after apply)
      ~ bucket_regional_domain_name = "cashewhands-fl-s3-bucket.s3.amazonaws.com" -> (known after apply)
      ~ hosted_zone_id              = "Z3AQBSTGFYJSTF" -> (known after apply)
      ~ id                          = "cashewhands-fl-s3-bucket" -> (known after apply)
      ~ object_lock_enabled         = false -> (known after apply)
      + policy                      = (known after apply)
      ~ region                      = "us-east-1" -> (known after apply)
      ~ request_payer               = "BucketOwner" -> (known after apply)
      - tags                        = {} -> null
      ~ tags_all                    = {
          + "Backup"        = "false"
          + "Environment"   = "development"
          + "Product-Owner" = "cashewhands"
          + "Project"       = "terraform-masterclass"
          + "Purpose"       = "CICD Pipeline involving Terraform and Github Actions"
          + "Repo"          = "https://github.com/cashewhands/terraform-masterclass"
          + "Team"          = "cashewhands"
          + "Terraform"     = "true"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
        # (1 unchanged attribute hidden)

      + cors_rule {
          + allowed_headers = (known after apply)
          + allowed_methods = (known after apply)
          + allowed_origins = (known after apply)
          + expose_headers  = (known after apply)
          + max_age_seconds = (known after apply)
        }

      - grant {
          - id          = "fc42cee51a82ce8b7ba3f49f6718adca8096771ec5af606e92d51374e3a46bb2" -> null
          - permissions = [
              - "FULL_CONTROL",
            ] -> null
          - type        = "CanonicalUser" -> null
        }
      + grant {
          + id          = (known after apply)
          + permissions = (known after apply)
          + type        = (known after apply)
          + uri         = (known after apply)
        }

      + lifecycle_rule {
          + abort_incomplete_multipart_upload_days = (known after apply)
          + enabled                                = (known after apply)
          + id                                     = (known after apply)
          + prefix                                 = (known after apply)
          + tags                                   = (known after apply)

          + expiration {
              + date                         = (known after apply)
              + days                         = (known after apply)
              + expired_object_delete_marker = (known after apply)
            }

          + noncurrent_version_expiration {
              + days = (known after apply)
            }

          + noncurrent_version_transition {
              + days          = (known after apply)
              + storage_class = (known after apply)
            }

          + transition {
              + date          = (known after apply)
              + days          = (known after apply)
              + storage_class = (known after apply)
            }
        }

      + logging {
          + target_bucket = (known after apply)
          + target_prefix = (known after apply)
        }

      + object_lock_configuration {
          + object_lock_enabled = (known after apply)

          + rule {
              + default_retention {
                  + days  = (known after apply)
                  + mode  = (known after apply)
                  + years = (known after apply)
                }
            }
        }

      + replication_configuration {
          + role = (known after apply)

          + rules {
              + delete_marker_replication_status = (known after apply)
              + id                               = (known after apply)
              + prefix                           = (known after apply)
              + priority                         = (known after apply)
              + status                           = (known after apply)

              + destination {
                  + account_id         = (known after apply)
                  + bucket             = (known after apply)
                  + replica_kms_key_id = (known after apply)
                  + storage_class      = (known after apply)

                  + access_control_translation {
                      + owner = (known after apply)
                    }

                  + metrics {
                      + minutes = (known after apply)
                      + status  = (known after apply)
                    }

                  + replication_time {
                      + minutes = (known after apply)
                      + status  = (known after apply)
                    }
                }

              + filter {
                  + prefix = (known after apply)
                  + tags   = (known after apply)
                }

              + source_selection_criteria {
                  + sse_kms_encrypted_objects {
                      + enabled = (known after apply)
                    }
                }
            }
        }

      + server_side_encryption_configuration {
          + rule {
              + bucket_key_enabled = (known after apply)

              + apply_server_side_encryption_by_default {
                  + kms_master_key_id = (known after apply)
                  + sse_algorithm     = (known after apply)
                }
            }
        }

      ~ versioning {
          ~ enabled    = false -> (known after apply)
          ~ mfa_delete = false -> (known after apply)
        }

      + website {
          + error_document           = (known after apply)
          + index_document           = (known after apply)
          + redirect_all_requests_to = (known after apply)
          + routing_rules            = (known after apply)
        }
    }

  # aws_s3_bucket_public_access_block.vpc-fl-bucket will be created
  + resource "aws_s3_bucket_public_access_block" "vpc-fl-bucket" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # aws_s3_bucket_server_side_encryption_configuration.example will be created
  + resource "aws_s3_bucket_server_side_encryption_configuration" "example" {
      + bucket = "cashewhands-flogs-s3-bucket"
      + id     = (known after apply)

      + rule {
          + apply_server_side_encryption_by_default {
              + sse_algorithm = "AES256"
            }
        }
    }

  # aws_s3_bucket_versioning.vpc-fl-bucket will be created
  + resource "aws_s3_bucket_versioning" "vpc-fl-bucket" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

  # aws_security_group.webserver_sg will be updated in-place
  ~ resource "aws_security_group" "webserver_sg" {
        id                     = "sg-05f49d53b4daf680a"
        name                   = "webserver-sg"
      ~ tags                   = {
          - "Purpose" = "CICD Pipeline involving Terraform & Github Actions" -> null
          - "Repo"    = "https://github.com/SecclTech/terraform-masterclass" -> null
        }
      ~ tags_all               = {
          ~ "Purpose"       = "CICD Pipeline involving Terraform & Github Actions" -> "CICD Pipeline involving Terraform and Github Actions"
          ~ "Repo"          = "https://github.com/SecclTech/terraform-masterclass" -> "https://github.com/cashewhands/terraform-masterclass"
            # (6 unchanged elements hidden)
        }
        # (7 unchanged attributes hidden)
    }

  # aws_vpc.vpc will be updated in-place
  ~ resource "aws_vpc" "vpc" {
        id                                   = "vpc-07193208af8312cf9"
      ~ tags                                 = {
          - "Purpose" = "CICD Pipeline involving Terraform & Github Actions" -> null
          - "Repo"    = "https://github.com/SecclTech/terraform-masterclass" -> null
        }
      ~ tags_all                             = {
          ~ "Purpose"       = "CICD Pipeline involving Terraform & Github Actions" -> "CICD Pipeline involving Terraform and Github Actions"
          ~ "Repo"          = "https://github.com/SecclTech/terraform-masterclass" -> "https://github.com/cashewhands/terraform-masterclass"
            # (6 unchanged elements hidden)
        }
        # (16 unchanged attributes hidden)
    }

Plan: 8 to add, 2 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan"

```

</details>

*Pusher: @cashewhands, Action: `pull_request`*